spec/support/vcr_cassettes/mpi/find_candidate/missing_birthday_and_gender.yml

---
http_interactions:
- request:
    method: post
    uri: "<MPI_URL>"
    body:
      encoding: ASCII-8BIT
      base64_string:
        CjxlbnY6RW52ZWxvcGUgeG1sbnM6c29hcGVuYz0iaHR0cDovL3NjaGVtYXMu
        eG1sc29hcC5vcmcvc29hcC9lbmNvZGluZy8iIHhtbG5zOnhzZD0iaHR0cDov
        L3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEiIHhtbG5zOmVudj0iaHR0cDov
        L3NjaGVtYXMueG1sc29hcC5vcmcvc29hcC9lbnZlbG9wZS8iIHhtbG5zOnhz
        aT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2Ui
        PgogIDxlbnY6SGVhZGVyLz4KICA8ZW52OkJvZHk+CiAgICA8aWRtOlBSUEFf
        SU4yMDEzMDVVVjAyIHhtbG5zOmlkbT0iaHR0cDovL3Zhd3cub2VkLm9pdC52
        YS5nb3YiIHhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxT
        Y2hlbWHigJBpbnN0YW5jZSIgeHNpOnNjaGVtYUxvY2F0aW9uPSJ1cm46aGw3
        4oCQb3JnOnYzIC4uLy4uL3NjaGVtYS9ITDdWMy9ORTIwMDgvbXVsdGljYWNo
        ZXNjaGVtYXMvUFJQQV9JTjIwMTMwNVVWMDIueHNkIiB4bWxucz0idXJuOmhs
        N+KAkG9yZzp2MyIgSVRTVmVyc2lvbj0iWE1MXzEuMCI+CiAgICAgIDxpZCBy
        b290PSIxLjIuODQwLjExNDM1MC4xLjEzLjAuMS43LjEuMSIgZXh0ZW5zaW9u
        PSIyMDBWR09WLTg2MDhhMTMxLTU3M2EtNDY4MC04M2QyLTFkNmE2ODEwMGMy
        NiIvPgogICAgICA8Y3JlYXRpb25UaW1lIHZhbHVlPSIyMDE5MDkwNTE3NDYx
        OCIvPgogICAgICA8dmVyc2lvbkNvZGUgY29kZT0iNC4xIi8+CiAgICAgIDxp
        bnRlcmFjdGlvbklkIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjEuNiIgZXh0
        ZW5zaW9uPSJQUlBBX0lOMjAxMzA1VVYwMiIvPgogICAgICA8cHJvY2Vzc2lu
        Z0NvZGUgY29kZT0iVCIvPgogICAgICA8cHJvY2Vzc2luZ01vZGVDb2RlIGNv
        ZGU9IlQiLz4KICAgICAgPGFjY2VwdEFja0NvZGUgY29kZT0iQUwiLz4KICAg
        ICAgPHJlY2VpdmVyIHR5cGVDb2RlPSJSQ1YiPgogICAgICAgIDxkZXZpY2Ug
        Y2xhc3NDb2RlPSJERVYiIGRldGVybWluZXJDb2RlPSJJTlNUQU5DRSI+CiAg
        ICAgICAgICA8aWQgcm9vdD0iMS4yLjg0MC4xMTQzNTAuMS4xMy45OTkuMjM0
        IiBleHRlbnNpb249IjIwME0iLz4KICAgICAgICA8L2RldmljZT4KICAgICAg
        PC9yZWNlaXZlcj4KICAgICAgPHNlbmRlciB0eXBlQ29kZT0iU05EIj4KICAg
        ICAgICA8ZGV2aWNlIGNsYXNzQ29kZT0iREVWIiBkZXRlcm1pbmVyQ29kZT0i
        SU5TVEFOQ0UiPgogICAgICAgICAgPGlkIHJvb3Q9IjIuMTYuODQwLjEuMTEz
        ODgzLjQuMzQ5IiBleHRlbnNpb249IjIwMFZHT1YiLz4KICAgICAgICA8L2Rl
        dmljZT4KICAgICAgPC9zZW5kZXI+CiAgICAgIDxjb250cm9sQWN0UHJvY2Vz
        cyBjbGFzc0NvZGU9IkNBQ1QiIG1vb2RDb2RlPSJFVk4iPgogICAgICAgIDxj
        b2RlIGNvZGU9IlBSUEFfVEUyMDEzMDVVVjAyIiBjb2RlU3lzdGVtPSIyLjE2
        Ljg0MC4xLjExMzg4My4xLjYiLz4KICAgICAgICA8ZGF0YUVudGVyZXIgdHlw
        ZUNvZGU9IkVOVCIgY29udGV4dENvbnRyb2xDb2RlPSJBUCI+CiAgICAgICAg
        ICA8YXNzaWduZWRQZXJzb24gY2xhc3NDb2RlPSJBU1NJR05FRCI+CiAgICAg
        ICAgICAgIDxpZCBleHRlbnNpb249Ijc5NjExMTg2MyIgcm9vdD0iMi4xNi44
        NDAuMS4xMTM4ODMuNzc3Ljk5OSIvPgogICAgICAgICAgICA8YXNzaWduZWRQ
        ZXJzb24gY2xhc3NDb2RlPSJQU04iIGRldGVybWluZXJDb2RlPSJJTlNUQU5D
        RSI+CiAgICAgICAgICAgICAgPG5hbWU+CiAgICAgICAgICAgICAgICA8Z2l2
        ZW4+YWJyYWhhbTwvZ2l2ZW4+CiAgICAgICAgICAgICAgICA8ZmFtaWx5Pmxp
        bmNvbG48L2ZhbWlseT4KICAgICAgICAgICAgICA8L25hbWU+CiAgICAgICAg
        ICAgIDwvYXNzaWduZWRQZXJzb24+CiAgICAgICAgICA8L2Fzc2lnbmVkUGVy
        c29uPgogICAgICAgIDwvZGF0YUVudGVyZXI+CiAgICAgICAgPHF1ZXJ5QnlQ
        YXJhbWV0ZXI+CiAgICAgICAgICA8cXVlcnlJZCByb290PSIxLjIuODQwLjEx
        NDM1MC4xLjEzLjI4LjEuMTguNS45OTkiIGV4dGVuc2lvbj0iMTgyMDQiLz4K
        ICAgICAgICAgIDxzdGF0dXNDb2RlIGNvZGU9Im5ldyIvPgogICAgICAgICAg
        PG1vZGlmeUNvZGUgY29kZT0iTVZJLkNPTVAxLlJNUyIvPgogICAgICAgICAg
        PGluaXRpYWxRdWFudGl0eSB2YWx1ZT0iMSIvPgogICAgICAgICAgPHBhcmFt
        ZXRlckxpc3Q+CiAgICAgICAgICAgIDxsaXZpbmdTdWJqZWN0QWRtaW5pc3Ry
        YXRpdmVHZW5kZXI+CiAgICAgICAgICAgICAgPHZhbHVlIGNvZGU9Ik0iLz4K
        ICAgICAgICAgICAgICA8c2VtYW50aWNzVGV4dD5HZW5kZXI8L3NlbWFudGlj
        c1RleHQ+CiAgICAgICAgICAgIDwvbGl2aW5nU3ViamVjdEFkbWluaXN0cmF0
        aXZlR2VuZGVyPgogICAgICAgICAgICA8bGl2aW5nU3ViamVjdEJpcnRoVGlt
        ZT4KICAgICAgICAgICAgICA8dmFsdWUgdmFsdWU9IjE4MDkwMjEyIi8+CiAg
        ICAgICAgICAgICAgPHNlbWFudGljc1RleHQ+RGF0ZSBvZiBCaXJ0aDwvc2Vt
        YW50aWNzVGV4dD4KICAgICAgICAgICAgPC9saXZpbmdTdWJqZWN0QmlydGhU
        aW1lPgogICAgICAgICAgICA8bGl2aW5nU3ViamVjdElkPgogICAgICAgICAg
        ICAgIDx2YWx1ZSByb290PSIyLjE2Ljg0MC4xLjExMzg4My40LjEiIGV4dGVu
        c2lvbj0iNzk2MTExODYzIi8+CiAgICAgICAgICAgICAgPHNlbWFudGljc1Rl
        eHQ+U1NOPC9zZW1hbnRpY3NUZXh0PgogICAgICAgICAgICA8L2xpdmluZ1N1
        YmplY3RJZD4KICAgICAgICAgICAgPGxpdmluZ1N1YmplY3ROYW1lPgogICAg
        ICAgICAgICAgIDx2YWx1ZSB1c2U9IkwiPgogICAgICAgICAgICAgICAgPGdp
        dmVuPmFicmFoYW08L2dpdmVuPgogICAgICAgICAgICAgICAgPGZhbWlseT5s
        aW5jb2xuPC9mYW1pbHk+CiAgICAgICAgICAgICAgPC92YWx1ZT4KICAgICAg
        ICAgICAgICA8c2VtYW50aWNzVGV4dD5MZWdhbCBOYW1lPC9zZW1hbnRpY3NU
        ZXh0PgogICAgICAgICAgICA8L2xpdmluZ1N1YmplY3ROYW1lPgogICAgICAg
        ICAgPC9wYXJhbWV0ZXJMaXN0PgogICAgICAgIDwvcXVlcnlCeVBhcmFtZXRl
        cj4KICAgICAgPC9jb250cm9sQWN0UHJvY2Vzcz4KICAgIDwvaWRtOlBSUEFf
        SU4yMDEzMDVVVjAyPgogIDwvZW52OkJvZHk+CjwvZW52OkVudmVsb3BlPgo=
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Soapaction:
      - PRPA_IN201305UV02
      Date:
      - Thu, 05 Sep 2019 17:46:18 GMT
      Content-Length:
      - '3059'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Backside-Transport:
      - OK OK,OK OK
      Connection:
      - Keep-Alive
      Transfer-Encoding:
      - chunked
      Date:
      - Thu, 05 Sep 2019 17:46:18 GMT
      Content-Type:
      - text/xml
      Set-Cookie:
      - JSESSIONID=oHkCiL0-tNmJ3HehPPSnzEANXsTfllU2fxcwI1XLAHZOhWdGvOm6!1857127400;
        path=/; HttpOnly
      X-Global-Transaction-Id:
      - 4bae058f5d7149ea02b68ad2
    body:
      encoding: UTF-8
      string:
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
          xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
          xmlns:xsd="http://www.w3.org/2001/XMLSchema"
          xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
          <env:Header/>
          <env:Body>
            <idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd"
              xmlns:idm="http://vaww.oed.oit.va.gov"
              xmlns="urn:hl7-org:v3">
              <id extension="WSDOC1909051346188141501791109" root="2.16.840.1.113883.4.349"/>
              <creationTime value="20190905134618"/>
              <versionCode code="4.1"/>
              <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
              <processingCode code="T"/>
              <processingModeCode code="T"/>
              <acceptAckCode code="NE"/>
              <receiver typeCode="RCV">
                <device determinerCode="INSTANCE" classCode="DEV">
                  <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
                </device>
              </receiver>
              <sender typeCode="SND">
                <device determinerCode="INSTANCE" classCode="DEV">
                  <id extension="200M" root="2.16.840.1.113883.4.349"/>
                </device>
              </sender>
              <acknowledgement>
                <typeCode code="AA"/>
                <targetMessage>
                  <id extension="200VGOV-8608a131-573a-4680-83d2-1d6a68100c26" root="1.2.840.114350.1.13.0.1.7.1.1"/>
                </targetMessage>
                <acknowledgementDetail>
                  <code codeSystemName="MVI" code="132" displayName="IMT"/>
                  <text>Identity Match Threshold</text>
                </acknowledgementDetail>
                <acknowledgementDetail>
                  <code codeSystemName="MVI" code="120" displayName="PDT"/>
                  <text>Potential Duplicate Threshold</text>
                </acknowledgementDetail>
              </acknowledgement>
              <controlActProcess classCode="CACT" moodCode="EVN">
                <code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/>
                <queryAck>
                  <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
                  <queryResponseCode code="NF"/>
                  <resultCurrentQuantity value="0"/>
                </queryAck>
                <queryByParameter>
                  <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
                  <statusCode code="new"/>
                  <modifyCode code="MVI.COMP1.RMS"/>
                  <initialQuantity value="1"/>
                  <parameterList>
                    <livingSubjectAdministrativeGender>
                      <value code="M"/>
                      <semanticsText>Gender</semanticsText>
                    </livingSubjectAdministrativeGender>
                    <livingSubjectBirthTime>
                      <value value="18090212"/>
                      <semanticsText>Date of Birth</semanticsText>
                    </livingSubjectBirthTime>
                    <livingSubjectId>
                      <value extension="796111863" root="2.16.840.1.113883.4.1"/>
                      <semanticsText>SSN</semanticsText>
                    </livingSubjectId>
                    <livingSubjectName>
                      <value use="L">
                        <given>abraham</given>
                        <family>lincoln</family>
                      </value>
                      <semanticsText>Legal Name</semanticsText>
                    </livingSubjectName>
                  </parameterList>
                </queryByParameter>
              </controlActProcess>
            </idm:PRPA_IN201306UV02>
          </env:Body>
        </env:Envelope>
    http_version: 
  recorded_at: Thu, 05 Sep 2019 17:46:18 GMT
recorded_with: VCR 3.0.3
